In [4]:
import pandas as pd
import numpy as np
%matplotlib inline

In [5]:
df = pd.read_csv("kaggle_survey_2021_responses.csv", low_memory = False)

In [6]:
df.head(3)

,Time from Start to Finish (seconds),Q1,Q2,Q3,Q4,Q5,Q6,Q7_Part_1,Q7_Part_2,Q7_Part_3,...,Q38_B_Part_3,Q38_B_Part_4,Q38_B_Part_5,Q38_B_Part_6,Q38_B_Part_7,Q38_B_Part_8,Q38_B_Part_9,Q38_B_Part_10,Q38_B_Part_11,Q38_B_OTHER
0,Duration (in seconds),What is your age (# years)?,What is your gender? - Selected Choice,In which country do you currently reside?,What is the highest level of formal education ...,Select the title most similar to your current ...,For how many years have you been writing code ...,What programming languages do you use on a reg...,What programming languages do you use on a reg...,What programming languages do you use on a reg...,...,"In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor...","In the next 2 years, do you hope to become mor..."
1,910,50-54,Man,India,Bachelor’s degree,Other,5-10 years,Python,R,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,784,50-54,Man,Indonesia,Master’s degree,Program/Project Manager,20+ years,NaN,NaN,SQL,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None,NaN

### Series Object

A series object in pandas is simply a one-dimensional array of indexed data.It means that each element has an index, allowing one to access them using values and the index attributes.

    Syntax: 
        pd.Series(data, index = index)

index argument is optional

In [9]:
s = pd.Series([1,3,4,6,7,12]) # creating a pandas series using a list
s

0     1
1     3
2     4
3     6
4     7
5    12
dtype: int64

In [16]:
# as you can see the result shows a sequence of indices and values.

s.values # getting the values only

array([ 1,  3,  4,  6,  7, 12], dtype=int64)

In [17]:
s.index # accessing the indices

RangeIndex(start=0, stop=6, step=1)

In [18]:
# we can also get the values as follows:
s[0]

1

In [85]:
s[3]

6

In [86]:
s[:5]

0    1
1    3
2    4
3    6
4    7
dtype: int64

### The difference between Pandas Series Object and One-Dimensional array

The only difference between a series object and a Numpy one-dimensional array is the indices.An important feature of the series object is that the indices can take any type of value and can be set up in any way.

In [87]:
s = pd.Series([1,4,5,7,8,11], index = [2,3,8,4,6,7]) # the indices are different in this case
s

2     1
3     4
8     5
4     7
6     8
7    11
dtype: int64

In [88]:
s = pd.Series([2,3,4,5,6,7], index = ['b', 'c', 's', 'd', 'n', 'e']) # the indices are strings
s

b    2
c    3
s    4
d    5
n    6
e    7
dtype: int64

In [89]:
s['b']

2

In [90]:
# Creating Pandas Series Object using a dictionary 

name_age_dict = {'Alex': 22, 'John':17, 'Samantha': 25}

s = pd.Series(name_age_dict)
s

Alex        22
John        17
Samantha    25
dtype: int64

In [91]:
s['Alex'] # Accessing values

22

In [92]:
s['Alex':'Samantha'] # Slicing

Alex        22
John        17
Samantha    25
dtype: int64

### Pandas DataFrame Object

A dateframe object is similar to a Numpy two-dimensional array with row indices and column names.

In [93]:
age = pd.Series([20, 23, 35, 54])
name = pd.Series(['Smith', 'Robin', 'Alain', 'Pierre'])

df = pd.DataFrame({'Age':age,'Name':name})
df

   Age    Name
0   20   Smith
1   23   Robin
2   35   Alain
3   54  Pierre

In [94]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
quizzes = {'Smith': 65,
'Robin': 82,
'Alain': 48,
'Pierre': 95,
'John': 77}

In [23]:
# exemple from the book python for data science handbook

Final_exam = {'Smith': 89, 'Robin': 69, 'Alain': 97,
'Pierre': 70, 'John': 64}

In [24]:
student_stats = pd.DataFrame({'Quizzes': quizzes,
'Final Exam': Final_exam})

student_stats

        Quizzes  Final Exam
Smith        65          89
Robin        82          69
Alain        48          97
Pierre       95          70
John         77          64

In [25]:
student_stats.index

Index(['Smith', 'Robin', 'Alain', 'Pierre', 'John'], dtype='object')

In [27]:
student_stats['Quizzes']  # Calling a column name will return a Series of column data

Smith     65
Robin     82
Alain     48
Pierre    95
John      77
Name: Quizzes, dtype: int64

### Creating DataFrame

In [30]:
Q = pd.Series(quizzes) # A Series Object
Q

Smith     65
Robin     82
Alain     48
Pierre    95
John      77
dtype: int64

In [31]:
type(Q)

pandas.core.series.Series

In [32]:
pd.DataFrame(Q) # Creating a DataFrame from a Series Object

         0
Smith   65
Robin   82
Alain   48
Pierre  95
John    77

In [34]:
pd.DataFrame(Q, columns=['Quizzes']) # adding a column name

        Quizzes
Smith        65
Robin        82
Alain        48
Pierre       95
John         77

In [35]:
final_exam = pd.Series(Final_exam)
type(final_exam)

pandas.core.series.Series

In [37]:
pd.DataFrame(final_exam, columns=['Final Exam']) # creating another dataframe from another series object

        Final Exam
Smith           89
Robin           69
Alain           97
Pierre          70
John            64

In [38]:
# Creating a dataframe from a dictionary of series object

pd.DataFrame({'Quizzes': quizzes, 'Final Exam': final_exam})

        Quizzes  Final Exam
Smith        65          89
Robin        82          69
Alain        48          97
Pierre       95          70
John         77          64

In [108]:
# Creating a DataFrame from a 2-D Numpy array

pd.DataFrame(np.random.rand(2,2), columns=['name','age'], index = ['@','!'])

       name       age
@  0.855261  0.349573
!  0.777303  0.797035

### Data Selection in Series

In [40]:
# Lets work with a dataset df that was created earlier
# any single column of a dataframe is a series object. Lets prove that

type(df['Q1']) # second column of df

pandas.core.series.Series

In [42]:
Series_object = df['Q1']

In [43]:
Series_object[0] # Selecting the value of index 0

'What is your age (# years)?'

In [44]:
Series_object[1]

'50-54'

In [45]:
'a' in Series_object # is 'a' an index of Series_object

False

In [46]:
2 in Series_object # is 2 an index of Series_object?

True

In [47]:
Series_object.keys() # selecting the indices of Series_object

RangeIndex(start=0, stop=25974, step=1)

In [56]:
# changing the content of a Series object

Series_object[5,8] = 9 # changing the values for index 5 and 8 to 9
Series_object.head(10)

0    What is your age (# years)?
1                          50-54
2                          50-54
3                          22-24
4                          45-49
5                              9
6                          25-29
7                          18-21
8                              9
9                          22-24
Name: Q1, dtype: object

### Slicing Pandas Series

In [106]:
Series_object[0:4] # Selecting from index 0 to index 5

0    What is your age (# years)?
1                          50-54
2                          50-54
3                          22-24
Name: Q1, dtype: object

In [107]:
Series_object[[0,5]] # Selecting index 0 and 5

0    What is your age (# years)?
5                              9
Name: Q1, dtype: object

In [112]:
Series_object[(Series_object == '50-54')].head() # selecting ages between 50-54

1      50-54
2      50-54
17     50-54
77     50-54
161    50-54
Name: Q1, dtype: object

In [113]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [114]:
data[3] # explicit index when indexing, your way of indexing

'b'

In [115]:
data[5]

'c'

In [105]:
data[1:3] # implicit index when indexing uses the python-style index, python way of slicing

4    b
6    c
dtype: object

### Loc and iloc

0        What is your age (# years)?
1                              50-54
2                              50-54
3                              22-24
4                              45-49
                    ...
25969                          30-34
25970                          22-24
25971                          50-54
25972                          45-49
25973                          18-21
Name: Q1, Length: 25974, dtype: object